Autodesk.Navisworks.Api.ViewpointDistanceType
Describes the user's intentions if the product has to modify near and far distances (typically because of graphics system limitations).

Autodesk.Navisworks.Api.ViewpointDistanceType.Fixed
User has specified exact distance.

Autodesk.Navisworks.Api.ViewpointDistanceType.Constrained
For near distance, user has specified maximum distance and the product can use a smaller value to increase render quality. For far distance, user has specified minimum distance and the product can use a larger value to increase render quality.

Autodesk.Navisworks.Api.ViewpointDistanceType.Auto
Distance was chosen automatically by the product.